In [9]:
# DATA ENGINEERING SKILLS
# CREATING DATAFRAME
import pandas as pd

In [11]:
data = { 'name' : ['Alice' , 'Bob' , 'Charlie'],
        'age' : [20 , 50 , 40] , 
         'city' : ['New York' , 'Mumbai' , 'LA']}

In [13]:
# CREATING A DUMMY EXCEL FILE TO SAVE RECORDS
pd.DataFrame(data).to_excel('Dummy df.xlsx' , index = False)   #removes index column from table

In [15]:
df = pd.read_excel('Dummy df.xlsx')

In [17]:
df

      name  age      city
0    Alice   20  New York
1      Bob   50    Mumbai
2  Charlie   40        LA

In [19]:
# CREATING A LIST FOR USER INPUT
# TAKE INPUT FROM THE USERS

li =[]
user_name = input('Enter your name : ')
li.append(user_name)
user_age = input('Enter your age : ')
li.append(user_age)
user_city = input('Enter your city : ')
li.append(user_city)

Enter your name :  shar
Enter your age :  20
Enter your city :  thane

In [21]:
# LOCATING THE FINAL LENGTH (INDEX-1)
df.loc[len(df)] = li

In [23]:
df.to_excel('Dummy df.xlsx',index=False)

In [25]:
# DELETING RECORD
# INPLACE = PERMANENT CHANCES ARE MADE
df.drop(index=3 , inplace = True)

In [27]:
# INDEX RESET WILL DELETE EXTRA INDEX COLUMN
df.reset_index(drop=True,inplace=True)

In [29]:
# MULTIPLE ROWS TO DELETE
df.drop(index= [3,4,5], inplace = True)

KeyError: '[3, 4, 5] not found in axis'

In [31]:
# CREATE SALARY LIST
salary_list = [10,20,30]

In [33]:
# CREATING A SALARY COLUMN IN DATASET
df['salary'] = salary_list

In [35]:
df

      name age      city  salary
0    Alice  20  New York      10
1      Bob  50    Mumbai      20
2  Charlie  40        LA      30

In [37]:
# DROPPING THE SALARY COLUMN
df.drop(['salary',], axis = 1)

      name age      city
0    Alice  20  New York
1      Bob  50    Mumbai
2  Charlie  40        LA

In [39]:
# DROPPING THE NULL VALUES FROM THE DATASET
df.dropna()

      name age      city  salary
0    Alice  20  New York      10
1      Bob  50    Mumbai      20
2  Charlie  40        LA      30

In [41]:
# WILL FILL NULL VALUES AS 0
df.fillna(0)

/var/folders/yt/5w_yb8t15bj9f7sd3w0dv2jc0000gn/T/ipykernel_1954/1456483695.py:2: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(0)

      name  age      city  salary
0    Alice   20  New York      10
1      Bob   50    Mumbai      20
2  Charlie   40        LA      30

In [43]:
# RENAME COLUMN : USE DICTONARY
df.rename(columns = {'name': 'USER NAME' , 'salary' : 'USER SALARY'} )

  USER NAME age      city  USER SALARY
0     Alice  20  New York           10
1       Bob  50    Mumbai           20
2   Charlie  40        LA           30

In [45]:
# FILTERING DATA : ONLY MUMBAI CITY RECORDS
df[df['city'] == 'Mumbai']

  name age    city  salary
1  Bob  50  Mumbai      20

In [47]:
# FILTERING : SALARY GREATER THAN 10
df[df['salary'] > 10]

      name age    city  salary
1      Bob  50  Mumbai      20
2  Charlie  40      LA      30

In [51]:
# MULTIPLE CONDITIONS
df[(df['salary'] > 10) & (df['city'] == 'Mumbai')]

  name age    city  salary
1  Bob  50  Mumbai      20

In [53]:
# FOR 'OR' USE | SYMBOL

In [55]:
# CHANGE DATA TYPE
df['age'] = df['age'].astype(int)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
 3   salary  3 non-null      int64
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes